export const cities = [
    "Αθήνα",        // Athens
    "Θεσσαλονίκη",  // Thessaloniki
    "Πάτρα",        // Patras
    "Λάρισα"        // Larissa
];

export const area = [
    { city: "Αθήνα", areas: ["Γαλάτσι", "Ηλιούπολη"] },
    { city: "Θεσσαλονίκη", areas: ["Τούμπα", "Καλαμαριά"] },
    { city: "Πάτρα", areas: ["Ρίο", "Αγυιά"] },
    { city: "Λάρισα", areas: ["Νεάπολη", "Φιλιππούπολη"] }
];

export const geitonia = [
    { area: "Γαλάτσι", geitonies: ["Ρίζου", "Νερουλού", "Αλσούπολη"] },
    { area: "Ηλιούπολη", geitonies: ["Αλσούπολη", "Κυψέλη", "Πλατεία Παπαδιαμάντη"] },
    { area: "Τούμπα", geitonies: ["Άνω Τούμπα", "Κάτω Τούμπα", "Σταυρούπολη"] },
    { area: "Καλαμαριά", geitonies: ["Κέντρο Καλαμαριάς", "Κρήνη", "Βυζάντιο"] },
    { area: "Ρίο", geitonies: ["Άγιος Βασίλειος", "Πανεπιστήμιο", "Καστελλόκαμπος"] },
    { area: "Αγυιά", geitonies: ["Πλατεία Γεωργίου", "Ψηλαλώνια", "Συντριβάνι"] },
    { area: "Νεάπολη", geitonies: ["Πλατεία Ταχυδρομείου", "Άγιος Γεώργιος", "Ανάληψη"] },
    { area: "Φιλιππούπολη", geitonies: ["Άγιος Αχίλλειος", "Δένδρα", "Νέα Σμύρνη"] }
];


export const hours = [
"07:00","08:00","09:00","10:00","11:00",
"12:00","13:00","14:00","15:00","16:00","17:00",
"18:00","19:00","20:00","21:00","22:00","23:00",
"00:00","01:00","02:00","03:00","04:00","05:00",
"06:00",
];
export const days = ["ΔΕΥ", "ΤΡΙ", "ΤΕΤ", "ΠΕΜ", "ΠΑΡ", "ΣΑΒ", "ΚΥΡ"];

// Randomly predefined availability matrix (7 days x 24 hours)
// export const availabilityMatrix = [
//     {day:'ΔΕΥ',hour:"12:00"},
//     {day:'ΤΡΙ',hour:"12:00"},
//     {day:'ΤΕΤ',hour:"14:00"},
//     {day:'ΠΕΜ',hour:"09:00"},
//     {day:'ΠΑΡ',hour:"18:00"},
//     {day:'ΣΑΒ',hour:"20:00"},
//     {day:'ΚΥΡ',hour:"07:00"},
//     {day:'ΤΡΙ',hour:"21:00"},
//     {day:'ΔΕΥ',hour:"08:00"},
//     {day:'ΔΕΥ',hour:"15:00"},
//     {day:'ΤΡΙ',hour:"10:00"},
//     {day:'ΤΡΙ',hour:"16:00"},
//     {day:'ΤΕΤ',hour:"11:00"},
//     {day:'ΤΕΤ',hour:"17:00"},
//     {day:'ΠΕΜ',hour:"13:00"},
//     {day:'ΠΕΜ',hour:"19:00"},
//     {day:'ΠΑΡ',hour:"09:00"},
//     {day:'ΠΑΡ',hour:"14:00"},
//     {day:'ΣΑΒ',hour:"12:00"},
//     {day:'ΣΑΒ',hour:"16:00"},
//     {day:'ΚΥΡ',hour:"10:00"},
//     {day:'ΚΥΡ',hour:"15:00"},
//     {day:'ΔΕΥ',hour:"20:00"},
//     {day:'ΤΡΙ',hour:"22:00"},
//     {day:'ΤΕΤ',hour:"23:00"},
//     {day:'ΠΕΜ',hour:"06:00"},
//     {day:'ΠΑΡ',hour:"07:00"},
//     {day:'ΣΑΒ',hour:"08:00"},
//     {day:'ΚΥΡ',hour:"09:00"},
//     {day:'ΔΕΥ',hour:"11:00"},
//     {day:'ΤΡΙ',hour:"13:00"},
//     {day:'ΤΕΤ',hour:"15:00"}
// ];