export const cities = [
    "Αθήνα",        // Athens
    "Θεσσαλονίκη",  // Thessaloniki
    "Πάτρα",        // Patras
    "Λάρισα"        // Larissa
];

export const area = [
    { city: "Αθήνα", areas: ["Γαλάτσι", "Ηλιούπολη"] },
    { city: "Θεσσαλονίκη", areas: ["Τούμπα", "Καλαμαριά"] },
    { city: "Πάτρα", areas: ["Ρίο", "Αγυιά"] },
    { city: "Λάρισα", areas: ["Νεάπολη", "Φιλιππούπολη"] }
];

export const geitonia = [
    { area: "Γαλάτσι", geitonies: ["Ρίζου", "Νερουλού", "Αλσούπολη"] },
    { area: "Ηλιούπολη", geitonies: ["Αλσούπολη", "Κυψέλη", "Πλατεία Παπαδιαμάντη"] },
    { area: "Τούμπα", geitonies: ["Άνω Τούμπα", "Κάτω Τούμπα", "Σταυρούπολη"] },
    { area: "Καλαμαριά", geitonies: ["Κέντρο Καλαμαριάς", "Κρήνη", "Βυζάντιο"] },
    { area: "Ρίο", geitonies: ["Άγιος Βασίλειος", "Πανεπιστήμιο", "Καστελλόκαμπος"] },
    { area: "Αγυιά", geitonies: ["Πλατεία Γεωργίου", "Ψηλαλώνια", "Συντριβάνι"] },
    { area: "Νεάπολη", geitonies: ["Πλατεία Ταχυδρομείου", "Άγιος Γεώργιος", "Ανάληψη"] },
    { area: "Φιλιππούπολη", geitonies: ["Άγιος Αχίλλειος", "Δένδρα", "Νέα Σμύρνη"] }
];


export const hours = [
"07:00","08:00","09:00","10:00","11:00",
"12:00","13:00","14:00","15:00","16:00","17:00",
"18:00","19:00","20:00","21:00","22:00","23:00",
"00:00","01:00","02:00","03:00","04:00","05:00",
"06:00",
];
export const days = ["ΔΕΥ", "ΤΡΙ", "ΤΕΤ", "ΠΕΜ", "ΠΑΡ", "ΣΑΒ", "ΚΥΡ"];

export const educationTitles=[
    "Πτυχίο Προσχολικής Αγωγής και Εκπαίδευσης",
    "Πτυχίο Βρεφονηπιοκομίας",
    "Πτυχίο στις Επιστήμες της Αγωγής (με κατεύθυνση Προσχολικής Εκπαίδευσης)",
    "Πτυχίο Κοινωνικής Εργασίας",
    "Βοηθός Βρεφονηπιοκόμου",
    "Προσχολική Αγωγή Δραστηριοτήτων Δημιουργίας και Έκφρασης",
    "Προσχολική Αγωγή Ημερήσιας Φροντίδας Παιδιών με Ειδικές Ανάγκες"
]

export const certificateTitles = [
    "Πιστοποίηση Πρώτων Βοηθειών (First Aid Certification)",
    "Πιστοποίηση Καρδιοαναπνευστικής Αναζωογόνησης (ΚΑΡΠΑ) (Cardiopulmonary Resuscitation - CPR Certification)",
    "Πιστοποίηση Αντιμετώπισης Παιδικών Ατυχημάτων (Child Injury Prevention Certification)",
    "Πιστοποίηση Σχολής Βρεφοκόμων (Infant Care Training Certification)",
    "Πιστοποίηση Διατροφής και Υγείας για Παιδιά (Nutrition and Health for Children Certification)",
    "Πιστοποίηση Συμπεριφορικής Διαχείρισης Παιδιών (Child Behavior Management Certification)",
    "Πιστοποίηση Αναπτυξιακής Ψυχολογίας για Παιδιά (Child Development Psychology Certification)",
    "Πιστοποίηση για Διδασκαλία Αγγλικών σε Παιδιά (English Language Teaching for Children Certification)",
    "Πιστοποίηση Υγιεινής και Ασφάλειας Στην Φροντίδα Παιδιών (Childcare Hygiene and Safety Certification)",
    "Πιστοποίηση Προσχολικής Αγωγής (Preschool Education Certification)"
];


export const greekMaleNames = [
    "Γεώργιος", "Δημήτριος", "Κωνσταντίνος", "Νικόλαος", "Αλέξανδρος",
    "Ιωάννης", "Παναγιώτης", "Χρήστος", "Αθανάσιος", "Ευάγγελος",
    "Σπυρίδων", "Ανδρέας", "Μιχαήλ", "Εμμανουήλ", "Στυλιανός",
    "Αριστείδης", "Θεόδωρος", "Περικλής", "Λουκάς", "Σωτήριος"
];

export const greekMaleSurnames = [
    "Παπαδόπουλος", "Νικολάου", "Γεωργίου", "Δημητρίου", "Κωνσταντίνου",
    "Αθανασίου", "Χριστοδούλου", "Αλεξίου", "Ιωάννου", "Παπανικολάου",
    "Παναγιωτόπουλος", "Χρηστίδης", "Σπυρόπουλος", "Ανδρέου", "Μιχαηλίδης",
    "Εμμανουήλ", "Στυλιανού", "Αριστείδου", "Θεοδώρου", "Περικλέους"
];
export const greekFemaleNames = [
    "Μαρία", "Ελένη", "Αικατερίνη", "Σοφία", "Αναστασία",
    "Βασιλική", "Γεωργία", "Δήμητρα", "Αγγελική", "Αλεξάνδρα",
    "Ιωάννα", "Παρασκευή", "Χριστίνα", "Παναγιώτα", "Αθανασία",
    "Ευαγγελία", "Στυλιανή", "Ανδρονίκη", "Θεοδώρα", "Περσεφόνη"
];

export const greekFemaleSurnames = [
    "Παπαδοπούλου", "Νικολάου", "Γεωργίου", "Δημητρίου", "Κωνσταντίνου",
    "Αθανασίου", "Χριστοδούλου", "Αλεξίου", "Ιωάννου", "Παπανικολάου",
    "Παναγιωτοπούλου", "Χρηστίδου", "Σπυροπούλου", "Ανδρέου", "Μιχαηλίδου",
    "Εμμανουήλ", "Στυλιανού", "Αριστείδου", "Θεοδώρου", "Περικλέους"
];